{
  "title": "HR & Internship Controller Coordinator",
  "summary": "It's important to note that the specific responsibilities may vary depending on the NGO's size, structure, and available resources. Some organizations may have dedicated HR and internship program Coordinator, while others may combine these roles or assign them to different individuals within the organization. It is a Permanent-Type Position.",
  "category": "NGO Role"
},
{
  "title": "Roles",
  "summary": "Recruitment and Selection, Onboarding and Orientation, Documentation, Training and Development, Performance Management, Member Relations, Compliance and Legal Requirements, Reporting internship program's effectiveness, Collaboration with Departments, Alumni Engagement",
  "category": "Responsibilities"
},
{
  "title": "Responsibilities",
  "category": "Responsibilities",
  "subsections": [
    {
      "title": "Recruitment and Selection",
      "summary": "HR is responsible for identifying and hiring suitable candidates for various positions within the organization, ensuring a fair and transparent selection process."
    },
    {
      "title": "Onboarding and Orientation",
      "summary": "HR conducts orientation programs for new employees, familiarizing them with the organization's mission, values, policies, and procedures. The Coordinator provides orientation and training to interns, helping them understand the NGO's mission, values, and expectations."
    },
    {
      "title": "Member Relations",
      "summary": "HR manages employee relations, handles grievances, and creates a positive work environment to foster employee engagement and retention."
    },
    {
      "title": "Training and Development",
      "summary": "HR identifies training needs, organizes workshops, and facilitates skill development programs for employees to improve their capabilities."
    },
    {
      "title": "Records Management",
      "summary": "HR maintains accurate and up-to-date employee records, including personal details, attendance, leaves, and performance evaluations and maintains records of interns, their projects, evaluations, and other relevant data for future reference and program improvement."
    },
    {
      "title": "Supervision and Guidance",
      "summary": "The Internship Coordinator oversees the work of interns, provides guidance, and ensures they are working on meaningful projects that align with their learning objectives."
    },
    {
      "title": "Program Evaluation and Improvement",
      "summary": "The Coordinator assesses intern performance, provides feedback, and writes evaluations to help interns gauge their progress and areas of improvement. The Coordinator regularly assesses the effectiveness of the internship program and proposes improvements based on feedback and outcomes."
    },
    {
      "title": "Networking and Engagement",
      "summary": "The Internship Coordinator fosters a positive intern experience by organizing networking events, workshops, and activities to engage interns with the organization's community."
    },
    {
      "title": "Collaboration with Departments",
      "summary": "The Coordinator collaborates with different departments to identify internship opportunities that align with their needs and contribute to the organization's goals."
    }
  ]
    }

