[
  {
    "title": "External Public Relation Coordinator",
    "summary": "The role is crucial in managing the organization's external relationships and representing its interests to various stakeholders. The specific responsibilities may vary depending on the nature, size, and focus of the NGO. It's essential to adapt and prioritize your tasks based on the organization's needs and strategic objectives. It is a Permanent-Type Position.",
    "category": "NGO Role"
  },
  {
    "title": "Roles",
    "summary": "Stakeholder Engagement, Public Relations and Communications, Program/Project Development, Fundraising and Donor Relations, Coordinating the Event Management, Research and Reporting, Crisis Management, Collaboration and Teamwork, Community Engagement, Cross-functional Collaboration",
    "category": "Responsibilities"
  },
  {
    "title": "Responsibilities",
    "category": "Responsibilities",
    "subsections": [
      {
        "title": "Media Relations",
        "content": "Building and maintaining positive relationships with media outlets, journalists, and reporters to promote the NGO's activities, achievements, and events. This involves crafting press releases, organizing press conferences, and responding to media inquiries."
      },
      {
        "title": "Public Communication",
        "content": "Developing and implementing communication strategies to ensure consistent and accurate messaging about the NGO's mission, projects, and impact. This includes managing the organization's website, social media platforms, newsletters, and other communication channels."
      },
      {
        "title": "Brand Management",
        "content": "Ensuring that the NGO's brand identity is well-defined and consistently represented across all communication materials. This includes overseeing the design and production of promotional materials, brochures, and other collateral."
      },
      {
        "title": "Crisis Communication",
        "content": "Preparing and executing crisis communication plans to handle any negative publicity or emergencies effectively. This involves managing communication during sensitive or challenging situations to protect the organization's reputation."
      },
      {
        "title": "Public Events and Outreach",
        "content": "Organizing and coordinating public events, conferences, workshops, and other outreach activities to engage with stakeholders, donors, and the general public. This also includes participating in community events and networking opportunities."
      },
      {
        "title": "Partnerships and Collaborations",
        "content": "Identifying and establishing partnerships with other NGOs, corporations, government agencies, and relevant stakeholders to enhance the organization's visibility and reach."
      },
      {
        "title": "Fundraising Support",
        "content": "Collaborating with the fundraising team to create compelling communication materials that can attract donors and sponsors. This involves highlighting the impact of the organization's work and showcasing the importance of financial support."
      },
      {
        "title": "Internal Communication",
        "content": "Ensuring effective communication within the organization, facilitating the dissemination of information to all staff members and volunteers, and fostering a sense of unity and purpose."
      },
      {
        "title": "Logistics and Procurement",
        "content": "Managing logistical aspects such as transportation, procurement of supplies, and ensuring the smooth flow of operations."
      }
    ]
  }
]
