{
  "title": "Internal Compliance Committee Group",
  "summary": "Generally, the ICC is responsible for ensuring that the NGO adheres to applicable laws, regulations, and internal policies. It is important to note that the specific roles and responsibilities of an Internal Compliance Committee can vary depending on the size, nature, and geographical location of the NGO. Additionally, legal and regulatory requirements in different countries may impact the compliance framework for an NGO. It is a Permanent-Type Position.",
  "category": "NGO Role"
},
{
  "title": "Roles",
  "summary": "Policy Development, Compliance Monitoring, Investigation and Remediation, Ethical Standards, Risk Assessment, External Relationships, Continuous Improvement, Reporting and Documentation, Training and Education",
  "category": "Responsibilities"
},
{
  "title": "Responsibilities",
  "category": "Responsibilities",
  "subsections": [
    {
      "title": "Receiving Complaints",
      "summary": "The ICC is responsible for receiving and registering complaints related to any form of harassment, discrimination, or other misconduct from employees, volunteers, beneficiaries, or stakeholders of the organization."
    },
    {
      "title": "Investigating Complaints",
      "summary": "The ICC conducts thorough and impartial investigations into the complaints received. They gather evidence, interview relevant parties, and ensure confidentiality throughout the process."
    },
    {
      "title": "Maintaining Confidentiality",
      "summary": "The committee ensures the confidentiality of the complainant, respondent, and witnesses involved in the complaint. This confidentiality helps create a safe environment for people to come forward and report incidents without fear of retaliation."
    },
    {
      "title": "Providing Support",
      "summary": "The ICC provides support to the complainant during the investigation process, ensuring they are treated fairly and respectfully. This includes providing information on the procedure, offering counseling services if necessary, and ensuring they are not subjected to any victimization."
    },
    {
      "title": "Conflict Resolution",
      "summary": "Mediates conflicts and disputes among employees and between employees and management to maintain a harmonious work environment."
    },
    {
      "title": "Taking Corrective Measures",
      "summary": "If the ICC finds the complaint to be valid, it recommends appropriate actions and corrective measures to the management of the organization. These measures may include disciplinary action against the respondent, sensitization and training programs for employees, or any other steps to prevent such incidents in the future."
    },
    {
      "title": "Sensitization and Training",
      "summary": "The ICC is responsible for conducting awareness and sensitization programs within the organization to educate employees and stakeholders about their rights and responsibilities and to prevent instances of harassment or discrimination."
    },
    {
      "title": "Reporting and Documentation",
      "summary": "The ICC maintains thorough records of complaints, investigations, and actions taken. They also submit periodic reports to the management or governing body of the NGO on the complaints received, actions taken, and overall compliance with relevant laws and regulations."
    },
    {
      "title": "Policy Review and Compliance",
      "summary": "The committee periodically reviews the organization's policies and guidelines related to harassment, discrimination, and misconduct to ensure they are up to date and in compliance with the prevailing laws and regulations."
    }
  ]
}
